meme_dict = {
    "голда": "валюта стандофэ",
    "67": "номер дома, певца из америки",
    "52": "моргенштерн да здрасте ст петербург",
    "пантера": "хищное животное",
    "плесень": "человек пожилого возраста",
    "я тебя могну": "не пиши сюда больше",
    "черемша": "ну это заяц лев",
    "белый медведь": "поймете в ноябре",
    "69": "танец в мексике с использованием холодного оружия",
    "связь": "СВЯЗЬ",
    "смерть в нищите": "темка",
    "друн": "друг",
    "ало бизнес": "да да деньги",
    "ало деньги": "да да бизнес",
    "воздухан": "человек, который громко рассуждает о планах и успехах, но ничего не делает",
    "бурмалда": "эвфемизм для онлайн-казино; также всё нелепое и абсурдное",
    "можно а зачем": "фраза из интервью топ-менеджера АвтоВАЗа, символ отказа от ненужного",
    "фа ватафа пепе шнейне": "абсурдная фраза рэпера Ганвеста, означает «на богатом»",
    "котость": "кот Куки, мем",
    "нишевость": "движение против течения, фрагментация интернета",
    "да ты шуешь": "мем, порождённый китайским барбоскиным",
    "пухосос": "мем о вымышленных синих машинах, собирающих тополиный пух",
    "верните мой 2016-й": "ностальгический тренд",
    "ларпить": "изображать кого-то, строить из себя",
    "моггать": "превосходить кого-либо",
    "дрысясися": "пример тренда «Нейрослоп»",
    "зазеркалье": "абсурдистская мемная вселенная из TikTok",
    "мышь позора": "мем-картинка для народного дизлайка",
    "данил колбасенко": "школьник, ставший символом сигма-боя",
    "гугу гага": "скример-мем с Дедом Морозом из фольги",
    "фрукты-изменщики": "нейросериал с антропоморфными фруктами",
    "филяй-филяй": "мем из немецкой песни (vielleicht)",
    "луксмаксинг": "тренд на прокачку внешности",
    "бэкрумс": "интернет-миф о бесконечных жёлтых коридорах",
    "возьми телефон детка": "мем из стрима рэпера Toxi$",
    "село молочное": "мем с абсурдными роликами про пауков",
    "охаешечки-даттебаешечки": "переделка японского приветствия",
    "прайм-эра": "ностальгия по лучшим временам",
    "пацаноид пропал": "фраза из вселенной «Зазеркалья»",
    "нейрослоп": "абсурдный контент от нейросетей"
}

while True:
    meme_choice = input("")

    if meme_choice == "енд":
        break

    if meme_choice in meme_dict:
        print(" ")
        print(meme_dict[meme_choice])

    elif meme_choice == "я тебя могну":
        print(meme_dict[meme_choice])
        print(" ")
        break
